WHITE = ((255,255,255))          # используемые цвета
RED = ((255,0,0))
BLACK = ((0,0,0))
GRAY = ((127,127,127))
ALPHA_GRAY = ((127,127,127, 127))

WIDTH = 900                      # ширина и высота экрана
HEIGHT = 500

INPUT_FIELD = (50, 220, 800, 60) # координаты поля ввода
ALPHA_RECT = (50, 220, 400, 60)  # координаты прозрачной заливки
CONTOUR = 3                      # контур обводки поля ввода
COORD_X_IF_LH = 250              # координаты на поле ввода для левой и правой половин
COORD_X_IF_RH = 650
COORD_Y_IF = 250

COORD_X_RSENT = 647.5            # координаты для предложений на поле ввода для левой и правой половин
COORD_X_LSENT = 447.5
COORD_Y_SENT = 250
SZ = 16                          # количество отображаемых символов на каждой половине ввода
DELTA = 12.5                     # сдвиг букв в левой части поле ввода

FONT_SIZE_1 = 40                 # используемые размеры шрифтов
FONT_SIZE_2 = 30

RES_FIELD = (50, 300, 800, 100)  # координаты поля с результатами
COORD_X_RES = WIDTH/2            # координаты для отрисовки результатов в поле результатов
COORD_Y_RES = 350



